#include <stdio.h>

int main(void)
{
	int A; 
	int B; 
	int C;
	char M = 'a';

	printf("»çÄ¢¿¬»ê ÀÔ·Â(Á¤¼ö) : ");
	scanf_s("%d%c%d", &A, &M, sizeof(M), &B);
	//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!//!!!!!!!!!!!!!!!!!sizeof ±î¸ÔÀ¸¸é ¾ÈµÊ!!!!!!!!!!!!!!
	if (M == '+')
	{
		C = A + B;
	}
	else if (M == '-')
	{
		C = A - B;
	}
	else if (M == '*')
	{
		C = A * B;
	}
	else if (M == '/')
	{
		C = A / B;
	}

	printf("%d%c%d=%d\n", A, M, B, C);
return 0;
}